# SolidGeometryOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidGeometryOptions Properties
SolidGeometryOptions Class See Also
---
The SolidGeometryOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SolidTag | Optional solid tag for the Solid. |

# See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace